; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	spectrograph2 - mode
	infrared1 - mode
	infrared0 - mode
	thermograph3 - mode
	Star0 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Planet3 - direction
	Phenomenon4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Star7 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph2)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon5)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 167)
	(supports instrument1 spectrograph2)
	(supports instrument1 infrared1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 spectrograph2)
	(supports instrument2 infrared0)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 Star0)
	(supports instrument3 infrared0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet3)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 151)
	(supports instrument4 spectrograph2)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 infrared0)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 169)
	(supports instrument6 infrared0)
	(supports instrument6 spectrograph2)
	(calibration_target instrument6 Star0)
	(supports instrument7 infrared0)
	(supports instrument7 infrared1)
	(calibration_target instrument7 GroundStation2)
	(supports instrument8 thermograph3)
	(calibration_target instrument8 GroundStation1)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star6)
	(= (data_capacity satellite3) 1000)
	(= (fuel satellite3) 107)
	(= (data Planet3 spectrograph2) 118)
	(= (data Phenomenon4 spectrograph2) 212)
	(= (data Phenomenon5 spectrograph2) 41)
	(= (data Star6 spectrograph2) 226)
	(= (data Star7 spectrograph2) 36)
	(= (data Planet3 infrared1) 201)
	(= (data Phenomenon4 infrared1) 24)
	(= (data Phenomenon5 infrared1) 98)
	(= (data Star6 infrared1) 164)
	(= (data Star7 infrared1) 200)
	(= (data Planet3 infrared0) 300)
	(= (data Phenomenon4 infrared0) 225)
	(= (data Phenomenon5 infrared0) 293)
	(= (data Star6 infrared0) 57)
	(= (data Star7 infrared0) 169)
	(= (data Planet3 thermograph3) 61)
	(= (data Phenomenon4 thermograph3) 7)
	(= (data Phenomenon5 thermograph3) 76)
	(= (data Star6 thermograph3) 15)
	(= (data Star7 thermograph3) 182)
	(= (slew_time GroundStation2 Star0) 12)
	(= (slew_time Star0 GroundStation2) 12)
	(= (slew_time GroundStation2 GroundStation1) 37.76)
	(= (slew_time GroundStation1 GroundStation2) 37.76)
	(= (slew_time GroundStation1 Star0) 23.45)
	(= (slew_time Star0 GroundStation1) 23.45)
	(= (slew_time Planet3 Star0) 10.16)
	(= (slew_time Star0 Planet3) 10.16)
	(= (slew_time Planet3 GroundStation1) 20.23)
	(= (slew_time GroundStation1 Planet3) 20.23)
	(= (slew_time Planet3 GroundStation2) 18.53)
	(= (slew_time GroundStation2 Planet3) 18.53)
	(= (slew_time Phenomenon4 Star0) 2.319)
	(= (slew_time Star0 Phenomenon4) 2.319)
	(= (slew_time Phenomenon4 GroundStation1) 6.348)
	(= (slew_time GroundStation1 Phenomenon4) 6.348)
	(= (slew_time Phenomenon4 GroundStation2) 12.66)
	(= (slew_time GroundStation2 Phenomenon4) 12.66)
	(= (slew_time Phenomenon4 Planet3) 78.65)
	(= (slew_time Planet3 Phenomenon4) 78.65)
	(= (slew_time Phenomenon5 Star0) 11.03)
	(= (slew_time Star0 Phenomenon5) 11.03)
	(= (slew_time Phenomenon5 GroundStation1) 3.037)
	(= (slew_time GroundStation1 Phenomenon5) 3.037)
	(= (slew_time Phenomenon5 GroundStation2) 55.81)
	(= (slew_time GroundStation2 Phenomenon5) 55.81)
	(= (slew_time Phenomenon5 Planet3) 48.15)
	(= (slew_time Planet3 Phenomenon5) 48.15)
	(= (slew_time Phenomenon5 Phenomenon4) 28.63)
	(= (slew_time Phenomenon4 Phenomenon5) 28.63)
	(= (slew_time Star6 Star0) 25.11)
	(= (slew_time Star0 Star6) 25.11)
	(= (slew_time Star6 GroundStation1) 8.738)
	(= (slew_time GroundStation1 Star6) 8.738)
	(= (slew_time Star6 GroundStation2) 31.7)
	(= (slew_time GroundStation2 Star6) 31.7)
	(= (slew_time Star6 Planet3) 41.04)
	(= (slew_time Planet3 Star6) 41.04)
	(= (slew_time Star6 Phenomenon4) 3.565)
	(= (slew_time Phenomenon4 Star6) 3.565)
	(= (slew_time Star6 Phenomenon5) 93.23)
	(= (slew_time Phenomenon5 Star6) 93.23)
	(= (slew_time Star7 Star0) 39.35)
	(= (slew_time Star0 Star7) 39.35)
	(= (slew_time Star7 GroundStation1) 1.594)
	(= (slew_time GroundStation1 Star7) 1.594)
	(= (slew_time Star7 GroundStation2) 39.72)
	(= (slew_time GroundStation2 Star7) 39.72)
	(= (slew_time Star7 Planet3) 24.06)
	(= (slew_time Planet3 Star7) 24.06)
	(= (slew_time Star7 Phenomenon4) 62.78)
	(= (slew_time Phenomenon4 Star7) 62.78)
	(= (slew_time Star7 Phenomenon5) 16.04)
	(= (slew_time Phenomenon5 Star7) 16.04)
	(= (slew_time Star7 Star6) 11.76)
	(= (slew_time Star6 Star7) 11.76)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 Phenomenon5)
	(pointing satellite3 GroundStation2)
	(have_image Planet3 infrared0)
	(have_image Phenomenon5 infrared1)
	(have_image Star6 infrared0)
	(have_image Star7 infrared0)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite3 star0 star6)
   deleted: (pointing satellite3 star6)
   added: (pointing satellite3 star0)
   changed: (fuel satellite3) from 107 to 81.89, (fuel-used) from 0 to 25.11
   goals met: 1 of 6
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 6
3. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 1 of 6
4. (calibrate satellite3 instrument6 star0)
   added: (calibrated instrument6)
   goals met: 1 of 6
5. (turn_to satellite3 phenomenon4 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 phenomenon4)
   changed: (fuel satellite3) from 81.89 to 79.571, (fuel-used) from 25.11 to 27.429
   goals met: 1 of 6
6. (turn_to satellite0 groundstation1 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 167 to 163.963, (fuel-used) from 27.429 to 30.466
   goals met: 0 of 6
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
8. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 6
9. (turn_to satellite0 phenomenon5 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 163.963 to 160.926, (fuel-used) from 30.466 to 33.503
   goals met: 1 of 6
10. (turn_to satellite3 star6 phenomenon4)
   deleted: (pointing satellite3 phenomenon4)
   added: (pointing satellite3 star6)
   changed: (fuel satellite3) from 79.571 to 76.006, (fuel-used) from 33.503 to 37.068
   goals met: 1 of 6
11. (turn_to satellite1 star0 planet3)
   deleted: (pointing satellite1 planet3)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 151 to 140.84, (fuel-used) from 37.068 to 47.228
   goals met: 1 of 6
12. (turn_to satellite3 groundstation2 star6)
   deleted: (pointing satellite3 star6)
   added: (pointing satellite3 groundstation2)
   changed: (fuel satellite3) from 76.006 to 44.306, (fuel-used) from 47.228 to 78.928
   goals met: 2 of 6
13. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 2 of 6
14. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 2 of 6
15. (turn_to satellite1 phenomenon4 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 140.84 to 138.521, (fuel-used) from 78.928 to 81.247
   goals met: 2 of 6
16. (turn_to satellite1 star0 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 138.521 to 136.202, (fuel-used) from 81.247 to 83.566
   goals met: 2 of 6
17. (turn_to satellite1 phenomenon4 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 136.202 to 133.883, (fuel-used) from 83.566 to 85.885
   goals met: 2 of 6
18. (turn_to satellite1 star0 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 133.883 to 131.564, (fuel-used) from 85.885 to 88.204
   goals met: 2 of 6
19. (switch_off instrument3 satellite1)
   deleted: (power_on instrument3)
   added: (power_avail satellite1)
   goals met: 2 of 6
20. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 6
21. (turn_to satellite1 phenomenon4 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 131.564 to 129.245, (fuel-used) from 88.204 to 90.523
   goals met: 2 of 6
22. (turn_to satellite1 star0 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 129.245 to 126.926, (fuel-used) from 90.523 to 92.842
   goals met: 2 of 6
23. (calibrate satellite1 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 2 of 6
24. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 2 of 6
25. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 2 of 6
26. (turn_to satellite1 star6 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star6)
   changed: (fuel satellite1) from 126.926 to 101.816, (fuel-used) from 92.842 to 117.952
   goals met: 2 of 6
27. (turn_to satellite1 phenomenon4 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 101.816 to 98.251, (fuel-used) from 117.952 to 121.517
   goals met: 2 of 6
28. (turn_to satellite1 star0 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 98.251 to 95.932, (fuel-used) from 121.517 to 123.836
   goals met: 2 of 6
29. (turn_to satellite1 phenomenon4 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 95.932 to 93.613, (fuel-used) from 123.836 to 126.155
   goals met: 2 of 6
30. (turn_to satellite1 star6 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star6)
   changed: (fuel satellite1) from 93.613 to 90.048, (fuel-used) from 126.155 to 129.72
   goals met: 2 of 6
31. (turn_to satellite1 phenomenon4 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 90.048 to 86.483, (fuel-used) from 129.72 to 133.285
   goals met: 2 of 6
32. (take_image satellite0 phenomenon5 instrument0 infrared1)
   added: (have_image phenomenon5 infrared1)
   changed: (data_capacity satellite0) from 1000 to 902, (data-stored) from 0 to 98
   goals met: 3 of 6
33. (turn_to satellite1 star0 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 86.483 to 84.164, (fuel-used) from 133.285 to 135.604
   goals met: 3 of 6
34. (switch_off instrument1 satellite1)
   deleted: (power_on instrument1)
   added: (power_avail satellite1)
   goals met: 3 of 6
35. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 3 of 6
36. (turn_to satellite1 phenomenon4 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 84.164 to 81.845, (fuel-used) from 135.604 to 137.923
   goals met: 3 of 6
37. (turn_to satellite1 star0 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 81.845 to 79.526, (fuel-used) from 137.923 to 140.242
   goals met: 3 of 6
38. (turn_to satellite1 phenomenon4 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 79.526 to 77.207, (fuel-used) from 140.242 to 142.561
   goals met: 3 of 6
39. (turn_to satellite1 star0 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 77.207 to 74.888, (fuel-used) from 142.561 to 144.88
   goals met: 3 of 6
40. (turn_to satellite1 phenomenon4 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 74.888 to 72.569, (fuel-used) from 144.88 to 147.199
   goals met: 3 of 6
41. (turn_to satellite1 star6 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star6)
   changed: (fuel satellite1) from 72.569 to 69.004, (fuel-used) from 147.199 to 150.764
   goals met: 3 of 6
42. (turn_to satellite1 phenomenon4 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 69.004 to 65.439, (fuel-used) from 150.764 to 154.329
   goals met: 3 of 6
43. (turn_to satellite1 star0 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 65.439 to 63.12, (fuel-used) from 154.329 to 156.648
   goals met: 3 of 6
44. (switch_off instrument3 satellite1)
   deleted: (power_on instrument3)
   added: (power_avail satellite1)
   goals met: 3 of 6
45. (switch_on instrument2 satellite1)
   deleted: (calibrated instrument2) (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 3 of 6
46. (calibrate satellite1 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 3 of 6
47. (turn_to satellite1 phenomenon4 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 63.12 to 60.801, (fuel-used) from 156.648 to 158.967
   goals met: 3 of 6
48. (turn_to satellite1 star0 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 60.801 to 58.482, (fuel-used) from 158.967 to 161.286
   goals met: 3 of 6
49. (turn_to satellite1 phenomenon4 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 58.482 to 56.163, (fuel-used) from 161.286 to 163.605
   goals met: 3 of 6
50. (turn_to satellite1 star0 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 56.163 to 53.844, (fuel-used) from 163.605 to 165.924
   goals met: 3 of 6
51. (turn_to satellite1 phenomenon4 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 53.844 to 51.525, (fuel-used) from 165.924 to 168.243
   goals met: 3 of 6
52. (turn_to satellite1 star0 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 51.525 to 49.206, (fuel-used) from 168.243 to 170.562
   goals met: 3 of 6
53. (turn_to satellite1 phenomenon4 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 49.206 to 46.887, (fuel-used) from 170.562 to 172.881
   goals met: 3 of 6
54. (turn_to satellite1 star6 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star6)
   changed: (fuel satellite1) from 46.887 to 43.322, (fuel-used) from 172.881 to 176.446
   goals met: 3 of 6
55. (take_image satellite1 star6 instrument2 infrared0)
   added: (have_image star6 infrared0)
   changed: (data_capacity satellite1) from 1000 to 943, (data-stored) from 98 to 155
   goals met: 4 of 6
56. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 4 of 6
57. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 4 of 6
58. (turn_to satellite1 planet3 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 planet3)
   changed: (fuel satellite1) from 43.322 to 2.282, (fuel-used) from 176.446 to 217.486
   goals met: 4 of 6
59. (turn_to satellite2 groundstation1 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 groundstation1)
   changed: (fuel satellite2) from 169 to 160.262, (fuel-used) from 217.486 to 226.224
   goals met: 4 of 6
60. (turn_to satellite2 groundstation2 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 groundstation2)
   changed: (fuel satellite2) from 160.262 to 122.502, (fuel-used) from 226.224 to 263.984
   goals met: 4 of 6
61. (turn_to satellite3 phenomenon4 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 phenomenon4)
   changed: (fuel satellite3) from 44.306 to 31.646, (fuel-used) from 263.984 to 276.644
   goals met: 3 of 6
62. (turn_to satellite3 groundstation1 phenomenon4)
   deleted: (pointing satellite3 phenomenon4)
   added: (pointing satellite3 groundstation1)
   changed: (fuel satellite3) from 31.646 to 25.298, (fuel-used) from 276.644 to 282.992
   goals met: 3 of 6
63. (turn_to satellite3 star7 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 star7)
   changed: (fuel satellite3) from 25.298 to 23.704, (fuel-used) from 282.992 to 284.586
   goals met: 3 of 6
64. (take_image satellite3 star7 instrument6 infrared0)
   added: (have_image star7 infrared0)
   changed: (data_capacity satellite3) from 1000 to 831, (data-stored) from 155 to 324
   goals met: 4 of 6
65. (turn_to satellite3 groundstation1 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 groundstation1)
   changed: (fuel satellite3) from 23.704 to 22.11, (fuel-used) from 284.586 to 286.18
   goals met: 4 of 6
66. (turn_to satellite3 phenomenon4 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 phenomenon4)
   changed: (fuel satellite3) from 22.11 to 15.762, (fuel-used) from 286.18 to 292.528
   goals met: 4 of 6
67. (turn_to satellite3 groundstation2 phenomenon4)
   deleted: (pointing satellite3 phenomenon4)
   added: (pointing satellite3 groundstation2)
   changed: (fuel satellite3) from 15.762 to 3.102, (fuel-used) from 292.528 to 305.188
   goals met: 5 of 6
68. (switch_off instrument3 satellite1)
   deleted: (power_on instrument3)
   added: (power_avail satellite1)
   goals met: 5 of 6
69. (switch_on instrument2 satellite1)
   deleted: (calibrated instrument2) (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 5 of 6
70. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 5 of 6
71. (calibrate satellite2 instrument5 groundstation2)
   added: (calibrated instrument5)
   goals met: 5 of 6
72. (turn_to satellite2 planet3 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 planet3)
   changed: (fuel satellite2) from 122.502 to 103.972, (fuel-used) from 305.188 to 323.718
   goals met: 5 of 6
73. (take_image satellite2 planet3 instrument5 infrared0)
   added: (have_image planet3 infrared0)
   changed: (data_capacity satellite2) from 1000 to 700, (data-stored) from 324 to 624
   goals met: 6 of 6
